module Table where

-- アキュート（acute accent）´
acute :: [(Char, Char)]
acute = [('A', 'Á'), ('E', 'É'), ('I', 'Í'), ('O', 'Ó'), ('U', 'Ú'),
         ('a', 'á'), ('e', 'é'), ('i', 'í'), ('o', 'ó'), ('u', 'ú'),
         ('Y', 'Ý'), ('y', 'ý')]

-- グレイヴ（grave accent）`
grave :: [(Char, Char)]
grave = [('A', 'À'), ('E', 'È'), ('I', 'Ì'), ('O', 'Ò'), ('U', 'Ù'),
         ('a', 'à'), ('e', 'è'), ('i', 'ì'), ('o', 'ò'), ('u', 'ù')]

-- サーカムフレックス（circumflex）^
circumflex :: [(Char, Char)]
circumflex = [('A', 'Â'), ('E', 'Ê'), ('I', 'Î'), ('O', 'Ô'), ('U', 'Û'),
              ('a', 'â'), ('e', 'ê'), ('i', 'î'), ('o', 'ô'), ('u', 'û')]

-- チルダ（tilde）~
tilde :: [(Char, Char)]
tilde = [('A', 'Ã'), ('N', 'Ñ'), ('O', 'Õ'),
         ('a', 'ã'), ('n', 'ñ'), ('o', 'õ')]

-- ウムラウト（または分音記号 / diaeresis）:
diaeresis :: [(Char, Char)]
diaeresis = [('A', 'Ä'), ('E', 'Ë'), ('I', 'Ï'), ('O', 'Ö'), ('U', 'Ü'), ('Y', 'Ÿ'),
             ('a', 'ä'), ('e', 'ë'), ('i', 'ï'), ('o', 'ö'), ('u', 'ü'), ('y', 'ÿ')]

-- セディーユ（cedilla）,
cedilla :: [(Char, Char)]
cedilla = [('C', 'Ç'), ('c', 'ç')]

-- オゴネク（ogonek）;
ogonek :: [(Char, Char)]
ogonek = [('A', 'Ą'), ('E', 'Ę'), ('a', 'ą'), ('e', 'ę')]

-- ストローク（stroke）/
stroke :: [(Char, Char)]
stroke = [('L', 'Ł'), ('l', 'ł'), ('D', 'Đ'), ('d', 'đ')]

-- マクロン（macron）_
macron :: [(Char, Char)]
macron = [('A', 'Ā'), ('E', 'Ē'), ('I', 'Ī'), ('O', 'Ō'), ('U', 'Ū'),
          ('a', 'ā'), ('e', 'ē'), ('i', 'ī'), ('o', 'ō'), ('u', 'ū')]

-- ブレーヴ（breve）(
breve :: [(Char, Char)]
breve = [('A', 'Ă'), ('E', 'Ĕ'), ('G', 'Ğ'), ('I', 'Ĭ'), ('O', 'Ŏ'), ('U', 'Ŭ'),
         ('a', 'ă'), ('e', 'ĕ'), ('g', 'ğ'), ('i', 'ĭ'), ('o', 'ŏ'), ('u', 'ŭ')]
